Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_and_disability/supported_employment_for_people_with_disabilities.html.txt.tmx
Source language: en
Languages: ga

source: Supported employment for people with disabilities
ga: Fostaíocht le tacaíocht do dhaoine faoi mhíchumas

source: If you have a disability and wish to take up paid employment or you require assistance in finding a job, the EmployAbility Service (formerly the Supported Employment Service) may be able to help you. It provides people with disabilities with supports to help them access employment
ga: Má tá tú faoi mhíchumas agus más mian leat fostaíocht le pá a thógáil nó má theastaíonn cúnamh uait post a aimsiú, d'fhéadfadh sé go mbeadh cúnamh ar fáil duit ó Sheirbhís Infhostaitheachta (an tSeirbhís Fhostaíochta le Tacaíocht roimhe seo) Cuireann sé tacaíochtaí ar fáil do dhaoine faoi mhíchumas chun cabhrú leo rochtain a fháil ar fhostaíocht

source: The supports are provided by sponsor organisations on behalf of the Department of Social Protection – see ‘Sponsor organisations’ below
ga: Cuireann eagraíochtaí urraíochta na tacaíochtaí ar fáil ar son na Roinne Coimirce Sóisialaí – féach ‘Eagraíochtaí Urraíochta’ thíos

source: This is an employment and recruitment service to assist people, who have a range of disabilities and impairments, to obtain and keep a job
ga: Is seirbhís fhostaíochta agus earcaíochta í a thugann cúnamh do dhaoine atá faoi réimse míchumais agus laigí éagsúla a shocrú i bhfostaíocht agus le tacaíocht leanúnach a chur ar fáil dóibh

source: The Service provides a number of 'on-the-job' supports, such as a Job Coach who will assist both the employer and the person seeking employment
ga: Tá go leor tacaíochtaí "sa phost" le fáil ón gclár seo, Traenálaí Poist mar shampla a chuireann cúnamh ar fáil don fhostóir agus don té atá ag lorg fostaíochta

source: In order to avail of the EmployAbility Service, you must genuinely require the initial support of a Job Coach to obtain employment in the open market – see ‘Job Coach’ below
ga: Más mian leat leas a bhaint as an tSeirbhís Infhostaitheachta caithfidh sé i ndáiríre go bhfuil réamhthacaíocht ó Thraenálaí Poist ag teastáil uait le fostaíocht a fháil ar an margadh oscailte – féach ‘Traenálaí Poist’ thíos

source: The range of supports provided by the Service include:
ga: I measc an réimse tacaíochtaí a chuireann an tSeirbhís ar fáil, tá:

source: • Vocational profiling and career planning
ga: • Próifíliú gairmoideachais agus pleanáil gairme

source: • Job sourcing and job matching
ga: • Aimsiú poist agus meaitseáil post

source: • On-the-job support and coaching
ga: • Tacaíocht agus cóitseáil san ionad oibre

source: • Advice and support to employers
ga: • Comhairle agus tacaíocht d’fhostóirí

source: • Follow-up support and mentoring to both employers and employees
ga: • Tacaíocht agus meantóireacht athleantach d’fhostóirí agus d’fhostaithe araon

source: The Service provides jobseekers with career advice and employment support
ga: Cuireann an tSeirbhís comhairle ghairme agus tacaíocht fostaíochta ar fáil do chuardaitheoirí poist

source: Career advice includes identification of skills and assistance with searching for jobs
ga: Áirítear le comhairle ghairme sainaithint scileanna agus cúnaimh le cuardach do phoist

source: Employment support is provided when accessing vacancies and applying for jobs
ga: Cuirtear tacaíocht fostaíochta ar fáil nuair a bhíonn rochtain á fáil ar fholúntais agus nuair a bhíonn iarratas á dhéanamh ar phoist

source: It also includes matching skills with the employers’ needs, work experience placements, finding employers and assistance with integrating into the workplace
ga: Áirítear leis, chomh maith, scileanna a mheaitseáil le riachtanais an fhostóra, socrúcháin taithí oibre, teacht ar fhostóirí agus cúnamh a fháil agus comhtháthú á dhéanamh agat isteach san ionad oibre

source: The Service provides access to support services when required to maintain employment and advice on employment benefits and entitlements
ga: Soláthraíonn an tSeirbhís rochtain ar sheirbhísí tacaíochta nuair is gá chun fostaíocht agus comhairle a choimeád ar shochair agus ar theidlíochtaí fostaíochta

source: The EmployAbility Service’s supports for employers include:
ga: I measc thacaíochtaí na Seirbhísí Infhostaitheachta le haghaidh fostóirí, tá an méid a leanas:

source: • Free recruitment and employment service
ga: • Seirbhís saor in aisce earcaíochta agus fostaíochta

source: • Database of skilled jobseekers
ga: • Bunachar sonraí de chuardaitheoirí oilte poist

source: • Access to a committed, local work force
ga: • Rochtain ar lucht saothair tiomanta áitiúil

source: • On-going support from a professional team of Job Coaches
ga: • Tacaíocht leanúnach ó fhoireann ghairmiúil Chóitseálaithe Poist

source: • Advice on employment grants and supports – see below
ga: • Comhairle ar dheontais agus tacaíochtaí fostaíochta – féach thíos

source: Employment grants and supports
ga: Deontais agus tacaíochtaí fostaíochta

source: The Department of Social Protection funds a range of employment supports aimed at helping employees with a disability to gain and retain employment
ga: Cistíonn an Roinn Coimirce Sóisialaí réimse tacaíochtaí fostaíochta atá dírithe ar chabhrú le fostaithe atá faoi mhíchumas chun fostaíocht a fháil agus a choimeád

source: Under the Reasonable Accommodation Fund there is the Job Interview Interpreter Grant, the Personal Reader Grant, the Employee Retention Grant Scheme and the Workplace Equipment/Adaptation Grant
ga: Faoin gCiste Freastail Réasúnta, tá fáil ar an Deontas um Ateangaire ag Agallamh Poist, an Deontas Léitheora Phearsanta, an Scéim Deontais um Fhostaí a Choinneáil agus an Deontas um Threalamh/Oiriúnú Láthair Oibre

source: Other supports for employers include the Wage Subsidy Scheme and the Disability Awareness Training Support Scheme
ga: I measc na dtacaíochtaí eile tá an Scéim Fóirdheontas Tuarastail agus an Scéim Tacaíochta Oiliúna um Fheasacht ar Mhíchumas

source: Job Coaches offer on-the-job assistance and provide ongoing support to participants before, during and after employment
ga: Is féidir le Traenálaithe Poist cúnamh a thabhairt sa phost agus tacaíocht leanúnach a sholáthar do rannpháirtithe, roimh dóibh fostaíocht a thógáil, lena linn agus ina diaidh

source: If you have a disability, a Job Coach can help you by:
ga: Má tá tú faoi mhíchumas, is féidir le Traenálaí Poist cúnamh a thabhairt duit:

source: • Assisting you in identifying your skills, interests and aspirations
ga: • Do scileanna, spéiseanna agus aidhmeanna a aimsiú

source: This involves sitting down with you and going through a vocational profile of your skills and interests
ga: Ní mór dó/dí suí síos in éineacht leat agus dul tríd próifíl ghairmiúil de do scileanna agus spéiseanna

source: • Helping you to identifying suitable employment where your skills, interests and talents match the requirements of the job
ga: • Fostaíocht chuí a aimsiú ina mbeidh do scileanna, spéiseanna agus tallann oiriúnach don phost

source: • Examining the various tasks involved in the job and planning the various supports you will need
ga: • Na tascanna uilig a bhaineann leis an bpost a scrúdú agus na tacaíochtaí éagsúla a bheidh ag teastáil uait a phleanáil

source: • Helping you to develop the technical and social skills required to do the job
ga: • Na scileanna teicniúla agus sóisialta a theastóidh uait le dualgais an phoist a chomhlíonadh a fhorbairt

source: When you and your Job Coach have identified and agreed the type of work you are interested in securing, the next stage is to apply for work
ga: Nuair atá cinneadh déanta agat agus ag an Traenálaí Poist cén cineál oibre a bhfuil spéis agat inti, níl le déanamh ach iarratais ar obair a dhéanamh

source: This can be done by either applying for jobs appropriate to your skills and interests that are advertised in the normal way or by your Job Coach helping you to identify and apply for jobs in your area
ga: Is féidir iarratais a dhéanamh ar phostanna atá feiliúnach do na scileanna agus spéiseanna atá agat atá fógraithe sa ghnáth bhealach nó is féidir leis an Traenálaí Poist cúnamh a thabhairt duit postanna i do cheantar a aimsiú agus iarratais a dhéanamh orthu

source: Sometimes, this can involve your Job Coach contacting employers in your area or in your chosen field of work
ga: In amanta, bíonn ról ag an Traenálaí Poist i dteagmháil a dhéanamh le fostóirí sa cheantar nó le fostóirí sa réimse fostaíochta a bhfuil spéis agat inti

source: Job Coaches provide ongoing support to participants in a number of ways
ga: Cuireann Traenálaithe Poist tacaíocht leanúnach ar fáil do rannpháirtithe ar bhealaí éagsúla

source: For some participants (depending on need), the Job Coach can assist with training on-the-job and provide support in the immediate aftermath of employment, liasing with the person and his or her employer
ga: Is féidir leis an Traenálaí Poist (ag brath ar riachtanais) cúnamh a thabhairt do rannpháirtithe le traenáil sa phost agus tacaíocht a sholáthar nuair a thosaíonn an post ar dtús, teagmháil a chruthú leis an bhfostaí agus leis an bhfostóir

source: For other participants, the Job Coach can provide support and advice when they need it
ga: I gcás rannpháirtithe eile is féidir leis an Traenálaí Poist tacaíocht agus comhairle a chur ar fáil nuair a theastaíonn sé uathu

source: During a placement the Job Coach provides information, advice and ongoing support to employers
ga: Le linn socraithe cuireann an Traenálaí Poist eolas, comhairle agus tacaíocht leanúnach ar fáil do fhostóirí

source: Occasionally, the employer and employee may agree that the employment is not working out
ga: Ó am go ham, bíonn an fostóir agus an fostaí ar aon intinn nach bhfuil ag éirí leis an socrú

source: If this happens, the Job Coach can then step in and re-assess the situation with regard to further supports and assistance
ga: Sa chás seo, is féidir leis an Traenálaí Poist an scéal a mheas arís maidir le tacaíochtaí agus cúnamh a d'fhéadfaí a chur ar fáil sa todhchaí

source: The EmployAbility Service operates through sponsor organisations
ga: Oibríonn an tSeirbhís Infhostaitheachta trí eagraíochtaí urraíochta

source: Often these are local community and voluntary organisations that provide direct services to people with disabilities
ga: Go minic, is iad eagraíochtaí áitiúla pobail agus deonacha iad seo a chuireann seirbhísí díreacha ar fáil do dhaoine faoi mhíchumas

source: The sponsor employs Job Coaches to provide a range of supports to meet the needs of the individual jobseeker with a disability
ga: Fostaíonn an t-urraitheoir Cóitseálaithe Poist chun réimse tacaíochtaí a chur ar fáil chun freastal ar riachtanais an chuardaitheora poist aonair atá faoi mhíchumas

source: In order to participate in the EmployAbility Service, you must be between the ages of 18 and 65, need the support of a Job Coach in seeking and securing employment and must be job ready
ga: Ní mór i ndáiríre go mbeadh tú idir aois 18 agus 65 agus tacaíocht Traenálaí Poist ag teastáil uait le fostaíocht a lorg agus a fháil le páirt a ghlacadh sa tSeirbhís Infhostaitheachta agus ní mór duit a bheith réidh le post a glacadh

source: Job ready is defined as "A person who has the necessary training, education, motivation and ability to pursue work/career in the open labour market"
ga: Déantar cur síos ar dhuine atá réidh le post a glacadh mar "dhuine a bhfuil an traenáil, oideachas, spreagadh agus cumas cuí aige/aici le dul ag obair/i mbun gairme sa mhargadh saothair oscailte"

source: Participation in the EmployAbility Service is free
ga: Níl aon táille le híoc as a bheith páirteach i Seirbhís Infhostaitheachta

source: You do not have to pay for any of the supports you receive as a result of participation in this Service
ga: Ní gá duit íoc as aon cheann de na tacaíochtaí a chuirtear ar fáil duit de bharr do rannpháirtíochta sa Scéim seo

source: Anyone who is placed in employment through this scheme has the same employment rights as other employees
ga: Tá na cearta fostaíochta céanna ag aon duine a fhaigheann fostaíocht tríd an scéim seo agus atá ag gach fostaí eile

source: Your employer will pay your salary and you will agree the terms and conditions of employment in the same way as other employees
ga: Íocfaidh an fostóir tú agus tabharfaidh sé/sí téarmaí agus coinníollacha fostaíochta duit ar an mbealach céanna agus a thugtar d'fhostaithe eile iad

source: You should register with your local employment services office or Intreo centre and apply for the EmployAbility Service and express your interest in the Service
ga: Ba chóir duit clárú le d'oifig seirbhísí fostaíochta áitiúil nó ionad Intreo agus iarratas a dhéanamh ar an tSeirbhís Infhostaitheachta agus do spéis páirt a ghlacadh sa Scéim a chur in iúl

source: You can read more information in our document, Working with a disability
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad, Ag obair faoi mhíchumas

source: Contact your local employment services office or Intreo centre. You can also contact your local EmployAbility Service directly
ga: Déan teagmháil le d'oifig seirbhísí fostaíochta áitiúil nó ionad Intreo
